{
  "bg": {
    "Settings": "Настройки",
    "Theme": "Тема",
    "Accent": "Акцент",
    "Language": "Език",
    "Bulgarian": "Български",
    "English": "Англиски",
    "Splash screen" : "Начален екран",
    "The splash screen appears only once per hour to avoid annoyance. Turn that timer off here.": "Началният екран се появява само веднъж на час, за да се избегне досада. Изключете този таймер тук.",
    "Timer": "Таймер",
    "Vladimir Petrov": "Владимир Петров",
    "Aspiring software developer, eager to learn and expand my skills.": "Амбициозен софтуерен разработчик с желание да развие и разшири уменията си.",
    "years of learning": "години учене",
    "featured personal projects": "лични проекти",
    "motivated and ready": "мотивиран и готов",
    "Javascript is my language of choice for doing mostly anything but I am looking to expand my arsenal.": "Javascript е моят избран език за правене на почти всичко, но се стремя да разширя арсенала си.",
    "Out of all frameworks (or libraries) I haver the most professional experience with React having used it to build production ready code like banking software and administrative panels.": "От всички рамки (или библиотеки) имам най-много професионален опит с React, използвах го за изграждане на production код като банков софтуер и административни панели.",
    "Vue is my personal go-to framework having used it for a decent amount of admin dashboards and settings panels at work making it my second most used in a professional setting.": "Vue е моят избор за framework, използвал съм го за доста административни табла и панели с настройки по време на работа, което я прави втората ми най-използван в професионална среда.",
    "I have also used Svelte in a professional setting for a questioner app. This website also uses it because its' in-build functionalities are everything I need for this kind of quick project.": "Също така съм използвал Svelte в професионална среда за въпросник. Този уебсайт също го използва, защото неговите вградени функционалности са всичко, от което се нуждая за този вид бърз проект.",
    "Running Javascript on the server is how I started with this language. Node has allowed me to learn and expand my skills like no other tool." : "Изпълнението на Javascript на сървъра е начина, по който започнах с този език. Node ми позволи да науча и да разширя уменията си като никой друг инструмент.",
    "Express was my very first experience with web programming, using e.js I use to create SSR websites. Ive used it to build a literature guide website and my RPS game": "Express беше първият ми опит с уеб програмиране, ползвайки e.js създавах SSR уебсайтове. Използвах го, за да създам уебсайт за литератрни пройзведения и моята RPS игра.",
    "Altho I have used this tool for a long time, only recently was I able to unlock its' full potential. I really enjoy real time updates and this is my tool of choice": "Въпреки че ползвах този инструмент от дълго време, едва наскоро успях да отключа пълния му потенциал. Наистина се радвам на актуализации в реално време и това е моят инструмент по избор.",
    "Started learning C# in SoftUni on 13-05-2024. Stay tuned for updates!": "Започнах обучението си с C# в СофтУни на 13-05-2024. Очаквайте новини!",
    "Tools": "Инструменти",
    "For most of my personal projects I have used Mongo. I like the simplicity of document based databases so this, plus the mongoose package are my tools of choice.": "За повечето си лични проекти съм използвал Mongo. Харесвам простотата на базите данни, базирани на документи, така че това плюс пакетът mongoose, са инструментите който избирам всеки път.",
    "All of the professional applications I have worked with used some flavor of SQL be it Postgres, MySQL or something else.": "Всички професионални приложения, с които съм работил, използваха някакъв вкус на SQL, било то Postgres, MySQL или нещо друго.",
    "I use linux as my main operating system so I am familiar also comfortable with using the terminal.": "Използвам linux като основна операционна система, така че съм запознат и с терминала.",
    "Git is a part of almost all of my projects, be it for work or not, everything is being version controlled with it. Usually trough GitHub but i have also used GitLab and BitBucket.": "Git е част от почти всички мои проекти, било то за работа или не, всичко се контролира от версии с него. Обикновено чрез GitHub, но съм използвал и GitLab и BitBucket.",
    "Along with Jira I am familiar with SCRUM and all the artifacts and ceremonies that come with it. Ive used these tools/methods trough out most of my professional work.": "Заедно с Jira съм запознат със SCRUM и всички артефакти и церемонии, които идват с него. Използвал съм тези инструменти/методи през по-голямата част от професионалната си работа.",
    "Most of the tests I have written are unit tests with Jest. I also have experience with Mocha & Chai, Bun tests and Puppeteer.": "Повечето от тестовете, които съм написал, са модулни тестове с Jest. Имам опит и с Mocha & Chai, Bun tests и Puppeteer.",
    "Soft Skills": "Меки умения",
    "Given my experience in working with others on large projects, I have gained some valuable skills for working in a team with other people.": "Предвид моя опит в работата с други хора по големи проекти, придобих някои ценни умения за работа в екип с други хора.",
    "Team player": "Отборен играч",
    "It is easy to work in a team if we all get along so I always strive to get to know everyone and also do my part.": "Лесно е да се работи в екип, ако всички се разбираме, така че винаги се стремя да опозная всички и да изпълнявам своята роля.",
    "Adaptability": "Адаптивност",
    "I find it very easy to adapt to my current situation even if I start from zero. This is true for everything I do, getting to know my colleagues, code, the company.": "Смятам, че е много лесно да се адаптирам към сегашната си ситуация, дори ако започна от нулата. Това важи за всичко, което правя, колеги, кода, компанията.",
    "Communication": "Комуникация",
    "Communication is the most im portent part of any process in life. That is why I value it so highly.": "Комуникацията е най-важната част от всеки процес в живота. Ето защо го ценя толкова високо.",
    "Creativity": "Творчество",
    "For most solutions we often need creativity. Its a valuable skill to be able to come up with alternative ways of solving problems.": "За повечето решения често се нуждаем от креативност. Ценно умение е да можеш да измисляш алтернативни начини за решаване на проблеми.",
    "Started work at SoftBridge": "Започнах работа в SoftBridge",
    "My previous company didn't have much business so they had to close their doors so I had to find another place to go. I ended up at this product company developing cool software with cool people.": "Предишната ми компания нямаше много бизнес, така че трябваше да затворят вратите си, така че трябваше да намеря друго място, където да отида. В крайна сметка се озовах в тази продуктова компания, разработваща страхотен софтуер с готини хора.",
    "Finished the SoftUni JS path": "Завърших JS пътеката на SoftUni",
    "I managed to finish SoftUni with an excellent grade even while working and got certificate for my efforts.": "Успях да завърша СофтУни с отличен дори по време на работа и получих грамота за усилията си.",
    "SoftUni JS Certificate": "SoftUni JS сертификат",
    "Started work at Balkan Software Studio": "Започнах работа в Balkan Software Studio",
    "This was a small local company that allowed me to work on international projects by outstaring me to bigger teams that would usually be outside of my reach. Here I got to learn the most about what its like being in a team on a serous project.": "Това беше малка местна компания, която ми позволи да работя по международни проекти, като ме изпревари пред по-големи екипи, които обикновено бяха извън обсега ми. Тук трябва да науча най-много за това какво е да си в екип по сериозен проект.",
    "Started SoftUni": "Започнах SoftUni",
    "I wanted to master Javascript so I looked for a place to help me specialize in it so I started the JS path at SoftUni.": "Исках да овладея Javascript, затова потърсих място, което да ми помогне да се специализирам в него, така че започнах пътя на JS в SoftUni.",
    "Completed а PHP course": "Завърших курс по PHP",
    "The local dev community had a course for PHP, MYSQL and JS that I attended and completed. It was a great because it showed me another language besides JS and I was also among other developers.": "Местната общност на разработчиците имаше курс за PHP, MYSQL и JS, който посещавах и завърших. Беше страхотно, защото ми показа друг език освен JS и бях сред другите разработчици.",
    "Discord Bots": "Discord ботове",
    "At 16 I started creating scripts for Discord using their API, I had a couple of friends from all around the world helping me learn Javascript. This would later become \"KaoBot\", my very first project that serves people.": "На 16 започнах да създавам скриптове за Discord, използвайки техния API, имах няколко приятели от цял ​​свят, които ми помагаха да науча Javascript. По-късно това стана \"KaoBot\", първият ми проект, който служи на истински хора.",
    "First JS projects": "Първи JS проекти",
    "Up to now I had created a few HTML and CSS websites but it wasn't enough so I found out about and learned a bit of Javascript, using it to make some elements spin or change color, or for elements to appear when a button was clicked.": "Досега бях създал няколко уебсайта с HTML и CSS, но това не беше достатъчно, така че разбрах и научих малко Javascript, използвайки го, за да накарам някои елементи да се въртят или да променят цвета си, или елементи да се появяват, когато натисна бутон.",
    "First coding experience": "Първи опити кодиране",
    "I wrote my first ever peace of code at 14. It was a small Ruby text based adventure game. The best part is that I found a video of it.": "Написах първия си код на 14. Това беше малка приключенска игра, базирана на Ruby. Най-хубавото е, че намерих видеоклип от него.",
    "Embarrassing YouTube Video": "Видео в YouТube",
    "The website you are on right now! I decided it is time to collect all of my knowledge and experiences and display them in a single place. A cental hub for anyone interested in my work.": "Уебсайтът, на който се намирате в момента! Реших, че е време да събера всичките си знания и опит и да ги покажа на едно място. Централен център за всеки, който се интересува от работата ми.",
    "Visit Site": "Посети уебсайт",
    "View Repo": "Прегледай репо",
    "Real-time chatting application. Separated in two main parts: chatting directly or in groups; answering anonymous questions. This app aims to be a fun text adventure with other people.": "Приложение за чат в реално време. Разделени на две основни части: чат директно или в групи; отговаряйки на анонимни въпроси. Това приложение има за цел да бъде забавно текстово приключение с други хора.",
    "Simple shopping site made to practice Vue.js and Tailwind. I made it because I felt like it ¯\\_(ツ)_/¯": "Лесен сайт за пазаруване, направен за практикуване на Vue.js и Tailwind. Направих го, защото така ми се стори ¯\\_(ツ)_/¯",
    "I needed to decide which store was the best for another project so I decided to test them all out. In the end I decided to go with \"Nano\".": "Трябваше да реша кой магазин е най-добрият за друг проект, така че реших да ги тествам всичките. В крайна сметка реших да заложа на \"Нано\".",
    "Another practice app. I wanted to check out Vue.js but I decided that I will also check out tailwind and socket.io so I ended up making a game.": "Друго приложение за практика. Исках да проверя Vue.js, но реших, че ще проверя и tailwind и socket.io, така че в крайна сметка направих игра.",
    "This downloads books from the Pleven medical shool library (if you have access to it) and assembles them into whole PDF files. For some reason on their website each book is separated into PDFs with 1 page each and each PDF is on a different route. Looking trough the online library is not a fun experience... This app solves this problem.": "Това изтегля книги от библиотеката на Медицински факултет в Плевен (ако имате достъп до нея) и ги събира в цели PDF файлове. По някаква причина на уебсайта им всяка книга е разделена на PDF файлове с по 1 страница и всеки PDF е на различен маршрут. Преглеждането на онлайн библиотеката не е забавно изживяване... Това приложение решава този проблем.",
    "This application was made to solve a simple problem, fast pantone wallpaper generation. I came up with the idea while bousing an image board, when I shared the idea there I was met with support and so I made this.": "Това приложение е направено за решаване на прост проблем, бързо генериране на тапети pantone. Идеята ми хрумна, докато използвах табло за изображения, когато споделих идеята там, срещнах подкрепа и така направих това.",
    "GamBooru was inspired by the \"booru\" image board concept. This is my SoftUni Angular project for the final exam, I wanted to make something meaningful and fun but also different from all other projects.": "GamBooru е вдъхновен от концепцията за табло за изображения \"booru\". Това е моят SoftUni Angular проект за финалния изпит, исках да направя нещо смислено и забавно, но и различно от всички останали проекти.",
    "My first React website. I had to make it for the SoftUni exam so I stuck with something simple and improved on it. This social media clone expands on the traditional concept by adding unlimited likes.": "Първият ми уебсайт на React. Трябваше да се справя за изпита в СофтУни, затова се спрях на нещо просто и го подобрих. Този клонинг на социални медии разширява традиционната концепция, като добавя неограничен брой харесвания.",
    "After my success with KaoBot's mini-games I was inspired to make a full game! I decided to make Uno online but that was a tall task so I practiced multilayer, user accounts, scores, game state and other things I would need with this game.": "След успеха ми с мини-игрите на KaoBot бях вдъхновен да направя пълна игра! Реших да направя Uno онлайн, но това беше трудна задача, така че практикувах многослойност, потребителски акаунти, резултати, състояние на играта и други неща, които ще ми трябват с тази игра.",
    "This is more or less how I got into Javascript. At first this bot started as simple logging script to help me moderate my community but with time I expanded and added features to it. It soon grew to serve over 400 communities": "Горе-долу така навлязох в Javascript. Първоначално този бот започна като прост скрипт за регистриране, за да ми помогне да модерирам общността си, но с времето го разширих и добавих функции. Скоро се разрасна, за да обслужва над 400 общности",
    "...and many other smaller ones!": "...и много други по-малки!",
    "The story so far:": "Историята досега:",
    "Show more": "Покажи повече",
    "Welcome!": "Добре дошли!",
    "Header": "Начало",
    "Skills": "Умения",
    "Projects": "Проекти",
    "Journey": "История",
    "Contacts": "Контакти"
  }
}