{
  "Settings": ["Настройки"],
  "Theme": ["Тема"],
  "Accent": ["Акцент"],
  "Language": ["Език"],
  "Bulgarian": ["Български"],
  "English": ["Английски"],
  "Splash screen": ["Начален екран"],
  "The splash screen appears only once per hour, turn that timer off here.": [
    "Началният екран се показва само веднъж на час. Изключете този таймер тук."
  ],
  "Bulgaria, Vratsa": ["България, Враца"],
  "Timer": ["Таймер"],
  "Vladimir Petrov": ["Владимир Петров"],
  "Software developer, eager to learn and expand my skills.": [
    "Софтуерен разработчик с желание да развие и разшири уменията си."
  ],
  "years of learning": ["години на учене"],
  "featured personal projects": ["лични проекти"],
  "motivated and ready": ["мотивиран и готов"],
  "Started learning C# in SoftUni on 13-05-2024. Stay tuned for updates!": [
    "Започнах да уча C# в SoftUni на 13-05-2024. Очаквайте новини!"
  ],
  "Tools": ["Инструменти"],
  "Soft Skills": ["Социални умения"],
  "Team player": ["Отборен играч"],
  "Adaptability": ["Адаптивност"],
  "Communication": ["Комуникация"],
  "Creativity": ["Креативност"],
  "Started work at SoftBridge": ["Започнах работа в SoftBridge"],
  "My previous company didn't have much business, so they had to close their doors. I had to find another place to go and I ended up at this product company, developing cool software with cool people.": [
    "Предишната ми компания нямаше много бизнес, така че трябваше да затворят вратите си. Трябваше да намеря друго място и се озовах в тази продуктова компания, разработвайки готин софтуер с готини хора."
  ],
  "Finished the SoftUni JS path": ["Завърших JS пътеката в SoftUni"],
  "I managed to finish SoftUni with an excellent grade even while working, and I got a certificate for my efforts.": [
    "Успях да завърша SoftUni с отличен успех, дори докато работех, и получих сертификат за усилията си."
  ],
  "SoftUni JS Certificate": ["Сертификат за JS от SoftUni"],
  "Started work at Balkan Software Studio": ["Започнах работа в Balkan Software Studio"],
  "This was a small local company that allowed me to work on international projects by outsourcing me to bigger teams that would usually be outside of my reach. There I got to learn the most about what it's like being in a team on a serious project.": [
    "Това беше малка местна компания, която ми позволи да работя по международни проекти, като ме изпращаше на по-големи екипи, които обикновено биха били извън моето достижение. Тук научих най-много за това какво е да бъдеш в екип на сериозен проект."
  ],
  "Started SoftUni": ["Започнах SoftUni"],
  "I wanted to master JavaScript, so I looked for a place to help me specialize in it and I started the JS path at SoftUni.": [
    "Исках да овладея JavaScript, затова търсих място, което да ми помогне да се специализирам в него, и започнах JS пътеката в SoftUni."
  ],
  "Completed a PHP course": ["Завърших курс по PHP"],
  "The local dev community had a course for PHP, MySQL, and JS that I attended and completed. It was great because it showed me another language besides JS, as well as being among other developers.": [
    "Местната общност на разработчиците имаше курс по PHP, MySQL и JS, който посетих и завърших. Беше страхотно, защото ми показа друг език освен JS, и също така бях сред други разработчици."
  ],
  "Discord Bots": ["Discord Ботове"],
  "At 16, I started creating scripts for Discord using their API. I had a couple of friends from all around the world helping me learn JavaScript. That is how I created \"KaoBot\", my very first project that serves people.": [
    "На 16 години започнах да създавам скриптове за Discord, използвайки техния API. Имах няколко приятели от цял свят, които ми помагаха да науча JavaScript. Tака създадох \"KaoBot\", първият ми проект, който служи на хората."
  ],
  "First JS projects": ["Първи JS проекти"],
  "Up to now, I had created a few HTML and CSS websites, but it wasn't enough. So I found out about and learned a bit of JavaScript, using it to make some elements spin, change color or appear when a button was clicked.": [
    "До момента бях създал няколко уебсайта с HTML и CSS, но това не беше достатъчно. Така че открих и научих малко JavaScript, използвайки го, за да накарам някои елементи да се въртят или променят цвят, или за да се появяват елементи, когато се натисне бутон."
  ],
  "First coding experience": ["Първи опит с кодиране"],
  "I wrote my first ever piece of code at 14. It was a small Ruby text-based adventure game.": [
    "Написах първия си код на 14 години. Това беше малка текстова приключенска игра на Ruby."
  ],
  "Embarrassing YouTube Video": ["YouTube видео"],
  "The website you are on right now! I decided it is time to collect all of my knowledge and experiences and display them in a single place. A central hub for anyone interested in my work.": [
    "Уебсайтът, на който се намирате в момента! Реших, че е време да събера всичките си знания и опит и да ги представя на едно място. Централно място за всеки, който се интересува от моята работа."
  ],
  "Visit Site": ["Посетете сайта"],
  "View Repo": ["Вижте репото"],
  "Real-time chatting application. Separated into two main parts: chatting directly or in groups; answering anonymous questions. This app aims to be a fun text adventure with other people.": [
    "Приложение за чат в реално време. Разделено на две основни части: чат директно или в групи; отговаряне на анонимни въпроси. Това приложение цели да бъде забавно текстово приключение с други хора."
  ],
  "Simple shopping site made to practice Vue.js and Tailwind. I made it because I felt like it ¯\\_(ツ)_/¯": [
    "Прост сайт за пазаруване, създаден за да упражня Vue.js и Tailwind. Направих го, защото така ми се искаше ¯\\_(ツ)_/¯"
  ],
  "I needed to decide which store was the best for another project, so I decided to test them all out. In the end, I decided to go with \"Nano\".": [
    "Трябваше да реша кой магазин е най-добър за друг проект, затова реших да ги изпробвам всичките. В крайна сметка реших да избера \"Nano\"."
  ],
  "Another practice app. I wanted to check out Vue.js, but I decided that I will also check out Tailwind and Socket.io, so I ended up making a game.": [
    "Още едно приложение за практика. Исках да разгледам Vue.js, но реших, че ще разгледам също Tailwind и Socket.io, така че в крайна сметка направих игра."
  ],
  "This downloads books from the Pleven medical school library (if you have access to it) and assembles them into whole PDF files. For some reason, on their website, each book is separated into PDFs with 1 page each, and each PDF is on a different route. Looking through the online library is not a fun experience... This app solves this problem.": [
    "Това приложение изтегля книги от библиотеката на Медицински университет Плевен (ако имате достъп до нея) и ги сглобява в цели PDF файлове. По някаква причина на техния уебсайт всяка книга е разделена на PDF файлове с по една страница и всеки PDF е на различен път. Преглеждането на онлайн библиотеката не е приятно изживяване... Това приложение решава този проблем."
  ],
  "This application was made to solve a simple problem - fast pantone wallpaper generation. I came up with the idea while browsing an image board, and when I shared the idea there, I was met with support, so I made this.": [
    "Това приложение е създадено за решаване на прост проблем, бързо генериране на пантон тапети. Дойде ми идеята докато разглеждах изображение на табло, и когато споделих идеята там, получих подкрепа, така че го направих."
  ],
  "GamBooru was inspired by the \"booru\" image board concept. This is my SoftUni Angular project for the final exam. I wanted to make something meaningful and fun but also different from all other projects.": [
    "GamBooru е вдъхновен от концепцията на \"booru\" табло с изображения. Това е моят проект на SoftUni Angular за финалния изпит. Исках да направя нещо смислено и забавно, но също така различно от всички други проекти."
  ],
  "My first React website. I had to make it for the SoftUni exam, so I stuck with something simple and improved on it. This social media clone expands on the traditional concept by adding unlimited likes.": [
    "Моят първи уебсайт с React. Трябваше да го направя за изпита на SoftUni, така че се придържах към нещо просто и го подобрих. Този клонинг на социална мрежа разширява традиционната концепция чрез добавяне на неограничени харесвания."
  ],
  "After my success with KaoBot's mini-games, I was inspired to make a full game! I decided to make Uno online, but that was a tall task, so I practiced multiplayer, user accounts, scores, game state and other things I would need with this game.": [
    "След успеха ми с мини-игрите на KaoBot, бях вдъхновен да направя пълна игра! Реших да направя Uno онлайн, но това беше голяма задача, така че упражних мултиплеър, потребителски акаунти, резултати, състояние на играта и други неща, които биха ми трябвали за тази игра."
  ],
  "This is more or less how I got into JavaScript. At first, this bot started as a simple logging script to help me moderate my community, but with time I expanded and added features to it. It soon grew to serve over 400 communities.": [
    "Това е повече или по-малко как влязох в JavaScript. В началото този бот започна като прост скрипт за логване, за да ми помогне да модерирам моята общност, но с времето го разширих и добавих функции към него. Скоро той стана да обслужва над 400 общности"
  ],
  "...and many other smaller ones!": ["...и много други по-малки!"],
  "The story so far:": ["Моята историята досега:"],
  "Show more": ["Покажи повече"],
  "Welcome!": ["Добре дошли!"],
  "Header": ["Начало"],
  "Skills": ["Умения"],
  "Projects": ["Проекти"],
  "Journey": ["История"],
  "Contacts": ["Контакти"],

  "Just started here :D": ["Току-що започна тук :D"],
  "CFM - Software developer": ["CFM - Софтуерен разработчик"],
  "Used Vue 3 exclusively to build and maintain a website for document storage.": [
    "Използваше Vue 3 за създаване и поддръжка на уебсайт за съхранение на документи."
  ],
  "Designed pages and components using Vuetify, Tailwind and CSS to craft visually appealing animations and responsive user interfaces on both desktop and mobile.": [
    "Проектирах страници и компоненти с Vuetify, Tailwind и CSS за създаване на визуално привлекателни анимации и адаптивни интерфейси за настолни и мобилни устройства."
  ],
  "Developed tables, charts and other visualizations within dashboards to effectively display information for both users and administrators.": [
    "Разработени таблици, графики и други визуализации в табла за ефективно показване на информация за потребители и администратори."
  ],
  "SoftBridge - Software developer": ["SoftBridge - Софтуерен разработчик"],
  "Worked with big international teams consisting of 10+ people to build and maintain a large scale banking app featuring over 50 different interactive pages.": [
    "Работих в големи международни екипи с над 10 души за изграждане и поддръжка на мащабно банково приложение с над 50 различни интерактивни страници."
  ],
  "Also worked on smaller projects (Google analytics tool; Questionnaire app) Accommodated to the SCRUM style of work over the course of 3 projects using a variety of technologies. (React, Vue, Svelte)": [
    "Работил съм и по по-малки проекти (инструмент за Google Analytics; приложение за въпросници). Приспособен съм към SCRUM стила на работа в продължение на 3 проекта, използвайки различни технологии (React, Vue, Svelte)."
  ],
  "Collaborated with designers and senior developers while also mentoring interns and juniors.": [
    "Сътрудничих с дизайнери и старши разработчици, като също така наставлявах стажанти и младши разработчици."
  ],
  "Balkan Software Studio - Software developer": ["Balkan Software Studio - Софтуерен разработчик"],
  "Stronger together": ["По-силни заедно"],
  "I love the challenge": ["Обичам предизвикателствата"],
  "Listening, feedback, discussion": ["Слушане и обратна връзка"],
  "It is an art form": ["Това е форма на изкуство"],
  "Work ethic": ["Работна етика"],
  "Work hard, play hard": ["Работи и се забавлявай усилено"],
  "Experience": ["Опит"],
  "Professional": ["Професионален"],
  "Personal": ["Личен"]
}
